[
  {
    "id": 1,
    "title": "Aliens Landed in Bangkok",
    "shortDetail": "A mysterious light was seen over the Grand Palace.",
    "fullDetail": "Multiple witnesses reported seeing a glowing object descend rapidly over the Grand Palace late in the evening. Residents described unusual movements in the sky and flashes of light that lasted several minutes. Authorities, including the Bangkok Metropolitan Police and the Civil Aviation Authority, investigated the incident and stated that there is no evidence of extraterrestrial activity. Experts suggest the phenomenon could have been caused by a combination of atmospheric reflections and drone lights. Social media posts claiming alien landings quickly went viral, sparking debates online and attracting curiosity seekers to the area.",
    "reporter": "John Doe",
    "dateTime": "2025-08-20T14:30:00",
    "status": "fake",
    "image": "/src/assets/image1.jpg",
    "votes": { "fake": 12, "notFake": 3 },
    "comments": [
      { "user": "Jane", "text": "Looks photoshopped!", "imageUrl": "", "vote": "fake" },
      { "user": "Somchai", "text": "I was nearby, nothing happened.", "imageUrl": "", "vote": "notFake" }
    ]
  },
  {
    "id": 2,
    "title": "Bangkok Floods Reach New Record",
    "shortDetail": "The Chao Phraya River has overflowed.",
    "fullDetail": "Heavy rainfall over the past week has caused the Chao Phraya River to overflow, leading to widespread flooding in several Bangkok suburbs. Emergency services reported that thousands of residents have been evacuated from low-lying areas, and temporary shelters have been established. The flood has disrupted traffic, damaged homes, and affected businesses. Authorities have urged citizens to avoid traveling unless necessary and to follow updates from local disaster management offices. Meteorologists predict that water levels will remain high for the next few days, emphasizing the importance of precautionary measures.",
    "reporter": "Somchai Prasert",
    "dateTime": "2025-08-19T10:00:00",
    "status": "notFake",
    "image": "/src/assets/image2.jpg",
    "votes": { "fake": 2, "notFake": 15 },
    "comments": [
      { "user": "Nok", "text": "My house was flooded yesterday.", "imageUrl": "", "vote": "notFake" }
    ]
  },
  {
    "id": 3,
    "title": "Elon Musk Buys Thai Island",
    "shortDetail": "Rumors spread that Musk acquired a private island in Phuket.",
    "fullDetail": "Social media users speculated that Elon Musk had purchased a private island in Phuket to develop a private rocket testing site. The posts included images of luxury villas and private beaches with captions suggesting a secretive tech development project. Local authorities and real estate agents have denied these claims, stating that there is no record of such a transaction. Analysts warn the public to verify information from credible sources before sharing. The story quickly gained traction online, with hashtags trending across multiple platforms, highlighting the influence of viral misinformation in modern news cycles.",
    "reporter": "Lisa Chan",
    "dateTime": "2025-08-18T18:45:00",
    "status": "fake",
    "image": "/src/assets/image3.jpg",
    "votes": { "fake": 20, "notFake": 1 },
    "comments": [
      { "user": "Mark", "text": "Definitely fake news 😂", "imageUrl": "", "vote": "fake" }
    ]
  },
  {
    "id": 4,
    "title": "Thailand Wins World Cup 2026 Bid",
    "shortDetail": "FIFA allegedly awarded the 2026 World Cup to Thailand.",
    "fullDetail": "A viral post claimed that FIFA had awarded Thailand the hosting rights for the 2026 World Cup. The claim spread rapidly on social media, accompanied by images of celebratory crowds and stadium renderings. FIFA officially confirmed that the 2026 World Cup will be held across North America, including the United States, Canada, and Mexico. The Thai Football Association clarified that there had been no official bid or negotiations for the 2026 tournament. While the news was false, it sparked excitement among football fans in Thailand, showing the strong local interest in hosting international sporting events.",
    "reporter": "Michael Lee",
    "dateTime": "2025-08-17T12:20:00",
    "status": "fake",
    "image": "/src/assets/image4.jpg",
    "votes": { "fake": 14, "notFake": 0 },
    "comments": [
      { "user": "David", "text": "Would have been amazing if true!", "imageUrl": "", "vote": "fake" }
    ]
  },
  {
    "id": 5,
    "title": "New Train Line Opens in Bangkok",
    "shortDetail": "The Pink Line officially starts service.",
    "fullDetail": "Bangkok commuters welcomed the launch of the Pink Line, the latest addition to the city's expanding mass transit network. The transport ministry confirmed that the new line, which connects central Bangkok to the northern suburbs, is now fully operational. The project aims to reduce road congestion and provide faster, environmentally friendly transportation options. During the opening ceremony, officials highlighted the benefits of the line, including increased connectivity, modern stations with improved accessibility, and reduced travel times for daily commuters. Residents expressed excitement, noting the convenience this new service brings to their daily routines.",
    "reporter": "Napat Wong",
    "dateTime": "2025-08-16T09:00:00",
    "status": "notFake",
    "image": "/src/assets/image5.jpg",
    "votes": { "fake": 0, "notFake": 22 },
    "comments": [
      { "user": "Anna", "text": "Finally! My commute is easier now.", "imageUrl": "", "vote": "notFake" }
    ]
  },
  {
    "id": 6,
    "title": "Shark Spotted in Chao Phraya River",
    "shortDetail": "Viral video shows a shark fin in Bangkok waters.",
    "fullDetail": "A video circulating online claimed to show a shark swimming in the Chao Phraya River. Experts quickly debunked the footage, confirming that it had been digitally altered. Marine biologists explained that the river's freshwater environment and pollution levels make it impossible for sharks to survive. Authorities reassured the public that no dangerous animals were present and warned against spreading misinformation. The video nevertheless generated humorous reactions and sparked a discussion about verifying online content before sharing.",
    "reporter": "Aree Phan",
    "dateTime": "2025-08-15T14:10:00",
    "status": "fake",
    "image": "/src/assets/image6.jpg",
    "votes": { "fake": 19, "notFake": 2 },
    "comments": [
      { "user": "Ming", "text": "LOL, this is so fake.", "imageUrl": "", "vote": "fake" }
    ]
  },
  {
    "id": 7,
    "title": "Thailand Introduces Free Healthcare for All",
    "shortDetail": "Government announced expanded healthcare program.",
    "fullDetail": "The Thai government unveiled a plan to expand its universal healthcare program, promising access to free medical services for all citizens starting next year. Prime Minister David Kim confirmed that the initiative will include free preventive care, vaccinations, and essential treatments. The move has been praised by healthcare professionals as a significant step toward reducing inequality in access to medical services. Citizens expressed optimism about the program, noting that it could alleviate financial burdens and improve public health outcomes nationwide.",
    "reporter": "David Kim",
    "dateTime": "2025-08-14T08:30:00",
    "status": "notFake",
    "image": "/src/assets/image7.jpg",
    "votes": { "fake": 3, "notFake": 18 },
    "comments": [
      { "user": "Lalisa", "text": "This is great news for everyone!", "imageUrl": "", "vote": "notFake" }
    ]
  },
  {
    "id": 8,
    "title": "Bangkok Skytrain Extends to Pattaya",
    "shortDetail": "Social media claims BTS line will reach Pattaya.",
    "fullDetail": "A viral social media post claimed that Bangkok’s BTS Skytrain line would extend all the way to Pattaya. Transport officials denied the report, stating that no official plans currently exist for such an extension. Experts emphasized that the construction of a Skytrain line over such a long distance would require years of planning and significant investment. Despite the clarification, the post gained traction online, demonstrating how easily misinformation can spread and create public speculation about major infrastructure projects.",
    "reporter": "Siriwan Thong",
    "dateTime": "2025-08-13T19:15:00",
    "status": "fake",
    "image": "/src/assets/image8.jpg",
    "votes": { "fake": 10, "notFake": 1 },
    "comments": []
  },
  {
    "id": 9,
    "title": "First Thai Astronaut to Launch in 2026",
    "shortDetail": "Thailand to send astronaut with SpaceX mission.",
    "fullDetail": "Thailand confirmed that its first astronaut will participate in a SpaceX mission scheduled for 2026. The astronaut, trained in collaboration with international space agencies, will undergo rigorous preparation in both physical and technical aspects of space travel. Officials highlighted this milestone as a major achievement in Thailand's growing interest in space exploration and STEM education. The announcement has inspired students and professionals alike, with many expressing national pride in Thailand’s entry into the global space arena.",
    "reporter": "Anan Suwan",
    "dateTime": "2025-08-12T15:50:00",
    "status": "notFake",
    "image": "/src/assets/image9.jpg",
    "votes": { "fake": 1, "notFake": 12 },
    "comments": [
      { "user": "Aom", "text": "So proud of our country!", "imageUrl": "", "vote": "notFake" }
    ]
  },
  {
    "id": 10,
    "title": "McDonald's Launches Durian Burger",
    "shortDetail": "Viral photo shows McDonald's Thailand selling durian burgers.",
    "fullDetail": "A viral image circulating on social media suggested that McDonald's Thailand had introduced a durian-flavored burger. The post included pictures of a bun with durian slices and captions claiming it was officially on the menu. McDonald's Thailand quickly released a statement denying the claims, confirming that no such product exists. Marketing experts noted that the image appeared to be a photoshopped advertisement meant to attract attention. While the post generated amusement and curiosity among social media users, authorities warned against spreading misinformation without verification.",
    "reporter": "Chris Tan",
    "dateTime": "2025-08-11T11:25:00",
    "status": "fake",
    "image": "/src/assets/image10.jpg",
    "votes": { "fake": 17, "notFake": 0 },
    "comments": [
      { "user": "Ben", "text": "I’d actually try this 😂", "imageUrl": "", "vote": "fake" }
    ]
  },
  {
    "id": 11,
    "title": "Thai Baht Hits Record High",
    "shortDetail": "Currency strengthens against US dollar.",
    "fullDetail": "The Thai Baht reached its strongest value against the US dollar in a decade, with analysts citing strong export performance and increased foreign investment as key factors. Economists highlight that stable monetary policy and positive economic indicators contributed to the surge. Local businesses welcomed the news, noting that imports could become cheaper while exports may face minor cost challenges. Citizens expressed optimism, hoping for continued economic growth and stability. The central bank emphasized monitoring exchange rates to prevent sudden fluctuations and maintain balanced economic conditions.",
    "reporter": "Emily Clark",
    "dateTime": "2025-08-10T09:10:00",
    "status": "notFake",
    "image": "/src/assets/image11.jpg",
    "votes": { "fake": 2, "notFake": 14 },
    "comments": [
      { "user": "Ploy", "text": "Finally some good news for the economy!", "imageUrl": "", "vote": "notFake" },
      { "user": "", "text": "I hope it stays this way.", "imageUrl": "", "vote": "notFake" }
    ]
  },
  {
    "id": 12,
    "title": "Dinosaurs Found in Chiang Mai",
    "shortDetail": "Dig site revealed living dinosaurs underground.",
    "fullDetail": "A viral post claimed that living dinosaurs had been discovered in a dig site near Chiang Mai. Paleontologists immediately dismissed the claims, explaining that no living dinosaurs exist today and that the images were digitally manipulated. Scientists also highlighted that the alleged excavation site is a popular tourist area known for fossils of prehistoric animals, which may have contributed to confusion. Social media users reacted with humor, creating memes and jokes about the 'prehistoric breakthrough.' Authorities reminded the public to rely on verified scientific sources to avoid spreading hoaxes.",
    "reporter": "Mark Evans",
    "dateTime": "2025-08-09T16:40:00",
    "status": "fake",
    "image": "/src/assets/image12.jpg",
    "votes": { "fake": 25, "notFake": 0 },
    "comments": [
      { "user": "Tony", "text": "This has to be fake 😂", "imageUrl": "", "vote": "fake" }
    ]
  },
  {
    "id": 13,
    "title": "Chiang Mai Declared Smart City",
    "shortDetail": "Government invests in smart city tech.",
    "fullDetail": "The Thai government officially recognized Chiang Mai as a smart city, investing in Internet of Things (IoT) infrastructure, AI systems, and sustainable urban planning. Projects include intelligent traffic management, energy-efficient street lighting, and advanced public transportation monitoring. Officials stated that the initiative aims to improve residents’ quality of life, promote tourism, and attract international tech investments. Citizens welcomed the development, noting improvements in city services, environmental monitoring, and digital accessibility. Chiang Mai is now positioned as a model for urban innovation in Thailand.",
    "reporter": "Natasha Li",
    "dateTime": "2025-08-08T13:55:00",
    "status": "notFake",
    "image": "/src/assets/image13.jpg",
    "votes": { "fake": 0, "notFake": 11 },
    "comments": [
      { "user": "Kwan", "text": "Amazing progress!", "imageUrl": "", "vote": "notFake" }
    ]
  },
  {
    "id": 14,
    "title": "Giant Snake Found in Bangkok Mall",
    "shortDetail": "Photos show a python in a shopping mall.",
    "fullDetail": "Authorities confirmed that a giant python was found wandering inside a popular Bangkok shopping mall. Rescue teams were dispatched immediately and safely captured the snake without harm to visitors. Officials stated that the snake likely escaped from a nearby private collection or was displaced from a natural habitat. Mall management closed some areas temporarily to ensure public safety. Social media footage of the event quickly went viral, with citizens expressing surprise and relief. Wildlife experts emphasized the importance of reporting large reptiles to authorities promptly to prevent potential incidents.",
    "reporter": "Kittisak Rung",
    "dateTime": "2025-08-07T17:20:00",
    "status": "notFake",
    "image": "/src/assets/image14.jpg",
    "votes": { "fake": 1, "notFake": 16 },
    "comments": [
      { "user": "", "text": "Wow, saw it on news!", "imageUrl": "", "vote": "notFake" }
    ]
  },
  {
    "id": 15,
    "title": "Thailand Discovers Oil Reserves",
    "shortDetail": "Rumors claim massive oil fields found in Isan.",
    "fullDetail": "Rumors spread online that Thailand had discovered massive oil reserves in the Isan region. The Energy Ministry denied these reports, confirming that no new fields have been identified. Experts suggested that the viral posts were based on outdated geological surveys combined with speculation. Local residents expressed disappointment but also emphasized the need for accurate information. The incident serves as a reminder of the importance of relying on official government statements when reporting on natural resource discoveries.",
    "reporter": "Paul Harris",
    "dateTime": "2025-08-06T10:45:00",
    "status": "fake",
    "image": "/src/assets/image15.jpg",
    "votes": { "fake": 12, "notFake": 0 },
    "comments": [
      { "user": "Aom", "text": "Typical fake news!", "imageUrl": "", "vote": "fake" }
    ]
  },
  {
    "id": 16,
    "title": "Bangkok Air Quality Hits Record Low",
    "shortDetail": "Smog levels worsen in central Bangkok.",
    "fullDetail": "Bangkok's air pollution reached hazardous levels this week, with PM2.5 concentrations exceeding safe limits. The Pollution Control Department issued warnings for residents, especially children, the elderly, and people with respiratory issues, to avoid outdoor activities. The rise in smog is attributed to increased vehicle emissions, construction dust, and seasonal weather patterns. Local authorities recommended wearing masks, using air purifiers indoors, and limiting outdoor exposure. Public concern has prompted discussions about long-term solutions, including stricter vehicle emissions controls and green urban initiatives.",
    "reporter": "Supaporn Meechai",
    "dateTime": "2025-08-05T08:15:00",
    "status": "notFake",
    "image": "/src/assets/image16.jpg",
    "votes": { "fake": 0, "notFake": 20 },
    "comments": [
      { "user": "Lek", "text": "Need to wear masks daily now.", "imageUrl": "", "vote": "notFake" }
    ]
  },
  {
    "id": 17,
    "title": "Floating City Built in Gulf of Thailand",
    "shortDetail": "Viral claim shows futuristic city in the ocean.",
    "fullDetail": "Images and posts circulated online showing a futuristic floating city in the Gulf of Thailand. Architects and urban planners confirmed that no such project exists, and the images were generated using AI software. The viral content raised questions about responsible content creation and the spread of misinformation. Citizens discussed the potential benefits of floating cities, such as flood prevention and sustainable living, but experts clarified that current technology and budget constraints make such projects unrealistic at present. Authorities encouraged the public to verify the authenticity of viral content before sharing.",
    "reporter": "Angela Park",
    "dateTime": "2025-08-04T14:00:00",
    "status": "fake",
    "image": "/src/assets/image17.jpg",
    "votes": { "fake": 18, "notFake": 1 },
    "comments": [
      { "user": "Nok", "text": "Fake news, obviously!", "imageUrl": "", "vote": "fake" }
    ]
  },
  {
    "id": 18,
    "title": "Thai Student Wins Nobel Prize",
    "shortDetail": "Bangkok student awarded Nobel for physics.",
    "fullDetail": "In a historic achievement, a Thai student from Bangkok has been awarded the Nobel Prize in Physics for groundbreaking research in quantum materials. The announcement highlighted the student's innovative approach to superconductivity and advanced material properties. The Ministry of Education celebrated the accomplishment as a testament to Thailand's growing contribution to global science. Universities and research institutions praised the student’s work, noting its potential applications in energy and technology. Citizens expressed pride on social media, calling it an inspiring example for young scientists nationwide.",
    "reporter": "Rachel Lim",
    "dateTime": "2025-08-03T19:30:00",
    "status": "notFake",
    "image": "/src/assets/image18.jpg",
    "votes": { "fake": 0, "notFake": 25 },
    "comments": [
      { "user": "Tom", "text": "Inspiring!", "imageUrl": "", "vote": "notFake" }
    ]
  },
  {
    "id": 19,
    "title": "Time Traveler Arrested in Chiang Rai",
    "shortDetail": "Police allegedly caught a man from the future.",
    "fullDetail": "A video circulated online claiming that police in Chiang Rai had arrested a man allegedly from the future, showing him with futuristic gadgets and clothing. Authorities investigated and confirmed the footage was staged, and no such person existed. Experts in digital media confirmed the video was heavily edited with special effects. Social media users widely shared the video as a joke, and discussions arose about the dangers of misinformation. Authorities reminded the public to verify the authenticity of sensational claims before sharing.",
    "reporter": "Tom Richards",
    "dateTime": "2025-08-02T12:00:00",
    "status": "fake",
    "image": "/src/assets/image19.jpg",
    "votes": { "fake": 22, "notFake": 0 },
    "comments": [
      { "user": "", "text": "Haha, totally fake.", "imageUrl": "", "vote": "fake" }
    ]
  },
  {
    "id": 20,
    "title": "Thailand Opens First AI University",
    "shortDetail": "New university focused entirely on AI and robotics.",
    "fullDetail": "Thailand officially launched its first AI University in Bangkok, dedicated to advanced research in artificial intelligence, robotics, and data science. The Ministry of Education stated that the university aims to train a new generation of AI specialists to support national innovation and global competitiveness. Initial programs include robotics engineering, machine learning, and ethical AI governance. Industry leaders partnered with the university to offer internships and research opportunities. Students and academics expressed excitement, emphasizing the importance of cutting-edge education for Thailand’s future technological development.",
    "reporter": "Pimchanok S.",
    "dateTime": "2025-08-01T09:40:00",
    "status": "notFake",
    "image": "/src/assets/image20.jpg",
    "votes": { "fake": 1, "notFake": 19 },
    "comments": [
      { "user": "Sara", "text": "Exciting for students!", "imageUrl": "", "vote": "notFake" }
    ]
  },
  {
    "id": 21,
    "title": "Meteor Shower Visible in Chiang Mai Tonight",
    "shortDetail": "Skywatchers report a spectacular meteor shower.",
    "fullDetail": "Astronomers confirmed that a peak meteor shower will be visible tonight across northern Thailand, particularly in Chiang Mai. The annual Perseid meteor shower is expected to produce dozens of meteors per hour, with the best viewing conditions in rural areas away from city lights. Observatories encouraged enthusiasts to use telescopes or simply watch the sky with the naked eye. Local tourism agencies organized guided night tours and stargazing events. Citizens and visitors are eagerly preparing cameras and blankets for the experience, which promises a spectacular natural show.",
    "reporter": "Nicha Boon",
    "dateTime": "2025-08-26T21:00:00",
    "status": "notFake",
    "image": "/src/assets/image21.jpg",
    "votes": { "fake": 0, "notFake": 12 },
    "comments": [
      { "user": "Mint", "text": "Can’t wait to watch!", "imageUrl": "", "vote": "notFake" }
    ]
  },
  {
    "id": 22,
    "title": "Bangkok Subway to Introduce Night Service",
    "shortDetail": "MRT to operate until midnight starting next month.",
    "fullDetail": "The Bangkok Metropolitan Administration announced that the MRT subway will extend operating hours until midnight starting next month to alleviate evening traffic congestion. Officials stated that trains will run every 15 minutes during late-night hours, with increased security personnel for passenger safety. The move is part of a broader plan to enhance public transport convenience and reduce reliance on personal vehicles. Commuters welcomed the announcement, noting that it will improve accessibility for workers, tourists, and residents attending late events or nightlife activities.",
    "reporter": "Pawinee S.",
    "dateTime": "2025-08-25T10:30:00",
    "status": "notFake",
    "image": "/src/assets/image22.jpg",
    "votes": { "fake": 1, "notFake": 18 },
    "comments": [
      { "user": "Jo", "text": "Finally! So convenient.", "imageUrl": "", "vote": "notFake" }
    ]
  },
  {
    "id": 23,
    "title": "Giant Meteor Lands in Phuket",
    "shortDetail": "Viral post claims huge meteor crashed into beach.",
    "fullDetail": "A viral post claimed that a giant meteor had landed on a beach in Phuket, showing dramatic images of a crater and smoke. Scientists and local authorities quickly confirmed that no meteor had impacted the area. Experts said the images were digitally altered to create sensational content. The viral post led to social media discussions and jokes about 'apocalyptic scenarios.' Authorities reminded the public to rely on verified reports and not spread unconfirmed claims, especially those causing unnecessary panic.",
    "reporter": "Ken Wong",
    "dateTime": "2025-08-24T15:20:00",
    "status": "fake",
    "image": "/src/assets/image23.jpg",
    "votes": { "fake": 21, "notFake": 0 },
    "comments": [
      { "user": "Tae", "text": "Obvious fake news.", "imageUrl": "", "vote": "fake" }
    ]
  },
  {
    "id": 24,
    "title": "Thailand to Host International eSports Tournament",
    "shortDetail": "Bangkok selected as venue for global gaming event.",
    "fullDetail": "Thailand has been selected to host an international eSports tournament in Bangkok next year. The Ministry of Sports confirmed that the event will feature competitions in popular video games, attracting top players and teams worldwide. Organizers stated that the tournament aims to boost tourism, support youth engagement in technology, and showcase Thailand’s growing role in the gaming industry. Preparations include state-of-the-art venues, broadcast facilities, and interactive fan zones. Gamers and fans expressed excitement about participating and attending the event, highlighting Thailand’s emerging eSports scene.",
    "reporter": "Arisa Tan",
    "dateTime": "2025-08-23T13:00:00",
    "status": "notFake",
    "image": "/src/assets/image24.jpg",
    "votes": { "fake": 0, "notFake": 15 },
    "comments": [
      { "user": "Nok", "text": "Excited for this event!", "imageUrl": "", "vote": "notFake" }
    ]
  },
  {
    "id": 25,
    "title": "Bangkok Zoo Introduces Robot Animals",
    "shortDetail": "New robotic wildlife exhibit unveiled.",
    "fullDetail": "Bangkok Zoo unveiled a new robotic wildlife exhibit designed to educate children and visitors about animal behavior and conservation. The exhibit features interactive robots mimicking animals’ movements, sounds, and feeding habits. Officials explained that the initiative provides a safe and educational alternative to live animal interaction, highlighting conservation and sustainability. The response from visitors was overwhelmingly positive, with many praising the combination of technology and education. The zoo plans to expand the program with more species and interactive learning modules in the coming months.",
    "reporter": "Somchai R.",
    "dateTime": "2025-08-22T11:10:00",
    "status": "notFake",
    "image": "/src/assets/image25.jpg",
    "votes": { "fake": 2, "notFake": 14 },
    "comments": [
      { "user": "Kwan", "text": "Cool experience for kids.", "imageUrl": "", "vote": "notFake" }
    ]
  },
  {
    "id": 26,
    "title": "Bangkok Launches Electric Bus Fleet",
    "shortDetail": "City introduces 100 new electric buses.",
    "fullDetail": "The Department of Transport announced the launch of 100 electric buses in Bangkok to reduce emissions and modernize public transport. The buses feature low-noise, zero-emission technology, and are equipped with Wi-Fi and real-time GPS tracking. Authorities noted that the electric fleet will operate on key city routes and gradually expand over the next year. Citizens praised the initiative, emphasizing benefits such as cleaner air and a more sustainable urban transport system. Environmental groups highlighted the project as a major step towards greener city planning and climate-friendly initiatives.",
    "reporter": "Napat Wong",
    "dateTime": "2025-08-26T08:00:00",
    "status": "notFake",
    "image": "/src/assets/image26.jpg",
    "votes": { "fake": 0, "notFake": 16 },
    "comments": [
      { "user": "Anna", "text": "Good step for the environment!", "imageUrl": "", "vote": "notFake" }
    ]
  },
   {
    "id": 27,
    "title": "Mystery Crop Circles Appear in Chiang Rai",
    "shortDetail": "Unexplained patterns found overnight in fields.",
    "fullDetail": "Farmers in Chiang Rai discovered large, intricate crop circles overnight, sparking curiosity and speculation. Local experts and agricultural authorities investigated the phenomenon, concluding the designs were human-made hoaxes rather than natural or extraterrestrial occurrences. Drone footage showed symmetrical patterns in several rice fields. The news went viral on social media, leading to debates about hoax culture and public gullibility. Authorities advised visitors to respect farmland and avoid trespassing while enjoying the spectacle from a safe distance.",
    "reporter": "Tom Richards",
    "dateTime": "2025-08-25T19:40:00",
    "status": "fake",
    "image": "/src/assets/image27.jpg",
    "votes": { "fake": 14, "notFake": 1 },
    "comments": [
      { "user": "Lek", "text": "Clearly staged!", "imageUrl": "", "vote": "fake" }
    ]
  },
  {
    "id": 28,
    "title": "Bangkok Introduces Free Wi-Fi in Parks",
    "shortDetail": "Government provides free internet access in public areas.",
    "fullDetail": "Bangkok city council announced that major public parks will offer free high-speed Wi-Fi starting next month. The initiative aims to enhance accessibility, promote digital literacy, and encourage residents and tourists to spend more time outdoors. Technical teams have installed secure, high-capacity routers throughout popular park areas, ensuring stable connectivity. The city also plans to organize online educational workshops and digital events in parks, making them hubs for learning and recreation. Residents responded positively, highlighting convenience for students, remote workers, and casual users.",
    "reporter": "Siriwan Thong",
    "dateTime": "2025-08-24T12:30:00",
    "status": "notFake",
    "image": "/src/assets/image28.jpg",
    "votes": { "fake": 1, "notFake": 18 },
    "comments": [
      { "user": "Jo", "text": "This is amazing!", "imageUrl": "", "vote": "notFake" }
    ]
  },
  {
    "id": 29,
    "title": "Phuket Hosts International Kite Festival",
    "shortDetail": "Colorful kites take to the sky.",
    "fullDetail": "Phuket’s annual International Kite Festival attracted participants from around the world, showcasing vibrant and creative kite designs. The Tourism Board confirmed that over 200 competitors displayed traditional and modern kites in beach competitions, cultural performances, and interactive workshops. Spectators enjoyed kite-flying demonstrations, drone light shows, and local food markets. The festival promotes tourism, supports local artisans, and celebrates Thailand’s cultural heritage. Visitors praised the event’s organization and scenic coastal backdrop, making it one of the region’s most popular summer attractions.",
    "reporter": "Ken Wong",
    "dateTime": "2025-08-23T09:15:00",
    "status": "notFake",
    "image": "/src/assets/image29.jpg",
    "votes": { "fake": 0, "notFake": 13 },
    "comments": [
      { "user": "Mint", "text": "Love this festival!", "imageUrl": "", "vote": "notFake" }
    ]
  },
  {
    "id": 30,
    "title": "Giant Robot Spotted in Bangkok Streets",
    "shortDetail": "Viral video shows massive robot wandering city.",
    "fullDetail": "A video circulated on social media showing a massive robot walking through central Bangkok streets, alarming viewers. Authorities investigated and confirmed the footage was digitally created using CGI and augmented reality. Experts explained the viral clip was part of a marketing stunt for a robotics exhibition, not a real event. The incident sparked widespread discussion about digital content, misinformation, and public reaction to hyper-realistic visual effects. Residents expressed amusement and fascination, sharing memes and videos highlighting the fake robot scenario.",
    "reporter": "Angela Park",
    "dateTime": "2025-08-22T20:00:00",
    "status": "fake",
    "image": "/src/assets/image30.jpg",
    "votes": { "fake": 18, "notFake": 0 },
    "comments": [
      { "user": "Tae", "text": "Clearly fake!", "imageUrl": "", "vote": "fake" }
    ]
  },
  {
    "id": 31,
    "title": "Thailand Launches National Cycling Day",
    "shortDetail": "Encouraging citizens to use bicycles.",
    "fullDetail": "Thailand celebrated its first National Cycling Day, promoting bicycle use for health and environmental benefits. The Ministry of Transport and local municipalities organized citywide cycling events, safety workshops, and community rides. Officials emphasized the initiative as part of a larger plan to reduce traffic congestion, lower carbon emissions, and encourage active lifestyles. Citizens from all age groups participated, enjoying scenic routes, safety checkpoints, and educational programs. The event received media coverage and positive social media engagement, highlighting Thailand’s commitment to sustainable transport.",
    "reporter": "Pawinee S.",
    "dateTime": "2025-08-21T07:50:00",
    "status": "notFake",
    "image": "/src/assets/image31.jpg",
    "votes": { "fake": 0, "notFake": 15 },
    "comments": [
      { "user": "Sara", "text": "Great initiative!", "imageUrl": "", "vote": "notFake" }
    ]
  },
  {
    "id": 32,
    "title": "Phantom Submarine Sighted in Gulf of Thailand",
    "shortDetail": "Boaters report a strange underwater vessel.",
    "fullDetail": "Several boaters reported sighting a mysterious submarine-like vessel in the Gulf of Thailand, claiming it had unusual lights and movements. Naval authorities investigated and determined it was a misidentified commercial fishing vessel with reflective surfaces. The story went viral on social media, with many speculating about secret military operations. Experts and authorities emphasized the importance of verifying sightings before sharing, noting the human tendency to exaggerate unusual events. The incident served as a reminder about critical thinking and avoiding panic from unverified reports.",
    "reporter": "Chris Tan",
    "dateTime": "2025-08-20T17:20:00",
    "status": "fake",
    "image": "/src/assets/image32.jpg",
    "votes": { "fake": 16, "notFake": 1 },
    "comments": [
      { "user": "Ben", "text": "Totally fake.", "imageUrl": "", "vote": "fake" }
    ]
  },
  {
    "id": 33,
    "title": "Bangkok Hosts International Food Festival",
    "shortDetail": "Chefs from around the world showcase their cuisine.",
    "fullDetail": "Bangkok hosted an International Food Festival, featuring chefs from Asia, Europe, and the Americas showcasing their signature dishes. The Tourism Authority confirmed the festival included cooking workshops, live demonstrations, and competitions to highlight culinary diversity. Visitors experienced tasting sessions, street food zones, and cultural performances alongside the culinary exhibits. Organizers emphasized the event’s role in promoting tourism, supporting local businesses, and providing opportunities for cultural exchange. Residents and tourists enjoyed the vibrant atmosphere, capturing photos and sharing experiences online.",
    "reporter": "Emily Clark",
    "dateTime": "2025-08-19T11:45:00",
    "status": "notFake",
    "image": "/src/assets/image33.jpg",
    "votes": { "fake": 0, "notFake": 14 },
    "comments": [
      { "user": "Ploy", "text": "Can’t wait to try the food!", "imageUrl": "", "vote": "notFake" }
    ]
  },
  {
    "id": 34,
    "title": "Loch Ness Monster Found in Thai Lake",
    "shortDetail": "Viral post claims legendary creature spotted.",
    "fullDetail": "A viral post claimed that the legendary Loch Ness Monster had been spotted in a Thai lake, showing dramatic photos of a long, scaly creature. Local authorities and wildlife experts investigated and confirmed the images were digitally altered, with no evidence of such a creature in Thailand. The incident sparked jokes, memes, and viral social media commentary, emphasizing the public’s fascination with mythical creatures. Experts highlighted the importance of media literacy and verifying claims before sharing sensational images online. The story reminded citizens to differentiate between entertainment and factual news.",
    "reporter": "Mark Evans",
    "dateTime": "2025-08-18T16:10:00",
    "status": "fake",
    "image": "/src/assets/image34.jpg",
    "votes": { "fake": 22, "notFake": 0 },
    "comments": [
      { "user": "Tony", "text": "Obviously fake 😂", "imageUrl": "", "vote": "fake" }
    ]
  },
  {
    "id": 35,
    "title": "Thailand Introduces Smart Traffic Lights",
    "shortDetail": "AI-driven traffic management system deployed.",
    "fullDetail": "Bangkok city officials deployed AI-driven smart traffic lights at major intersections to improve traffic flow and reduce congestion. The system uses real-time data from cameras, sensors, and GPS-enabled vehicles to adjust signal timing dynamically. Officials reported that initial trials showed a significant reduction in average waiting times and smoother traffic movement. The project also aims to reduce vehicle emissions by minimizing idle times. Citizens praised the new technology, and traffic experts noted its potential for expansion to other Thai cities. The initiative is part of a broader smart city strategy to integrate AI solutions into urban infrastructure.",
    "reporter": "Natasha Li",
    "dateTime": "2025-08-17T08:30:00",
    "status": "notFake",
    "image": "/src/assets/image35.jpg",
    "votes": { "fake": 1, "notFake": 13 },
    "comments": [
      { "user": "Kwan", "text": "Really makes commuting easier!", "imageUrl": "", "vote": "notFake" }
    ]
  }
]
